Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_barcode_flow/SUI_docs_tbl_barcode_flow.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_barcode_flow</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_РежимыОткрытияДокументаОбмена/SUI_РежимыОткрытияДокументаОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_РежимыОткрытияДокументаОбмена</name>
  <enumValues>
    <name>Просмотр</name>
  </enumValues>
  <enumValues>
    <name>Выгрузка</name>
  </enumValues>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
  <enumValues>
    <name>ДокументОбмена</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_СостоянияДокументовОбмена/SUI_СостоянияДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияДокументовОбмена</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>КВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Загружен</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonForms/SUI_ЗагрузкаДокументаИзТСД/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ДокументСсылка, РежимОткрытия, НастройкаДокумента");

	ОбщегоНазначенияКлиентСервер.Проверить(SUI_ОбщегоНазначения.СсылкаСуществует(ДокументСсылка),
		НСтр("ru = 'Ссылка документа не существует.'"));
	
	Состояние = SUI_ДокументыОбмена.СостояниеДокументаОбмена(ДокументСсылка);
	
	Если РежимОткрытия = Перечисления.SUI_РежимыОткрытияДокументаОбмена.Загрузка Тогда

		Если Состояние = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Документ не был выгружен.'"), , , , Отказ);
			Возврат;
		ИначеЕсли Состояние = Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе Тогда 
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Документ находится в работе.
				|Дождитесь завершения работы пользователя над документом и повторите операцию загрузки.'"), , , , Отказ);
			Возврат;
		ИначеЕсли Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Завершен Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Документ был завершен.
				|Для загрузки документа выполните повторную выгрузку.'"), , , , Отказ);
			Возврат;
		ИначеЕсли Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.Выгружен И
			Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.Загружен Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Документ еще не был получен из мобильного устройства.'"), , , , Отказ);
			Возврат;
		КонецЕсли;
		
		СменитьСостояниеДокументаОбменаНаСервере(ДокументСсылка, НастройкаДокумента, 
			Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе);
	
	Иначе
		Элементы.ФормаКоманадаЗаписать.Видимость = Ложь;
	КонецЕсли;
		
	ИнициализироватьОбъектДокумента();
	
	ИнициализироватьРеквизитыИЭлементыФормы(Отказ);
	
	ЭтоДокументСборШК = (ДокументСсылка.Метаданные() = Метаданные.Документы.SUI_СборШтрихкодов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ДанныеДокументаОбменаКЗагрузкеВДокумент();
	
	Элементы.СтраницаПотокШтрихкодов.Видимость = ЭтоДокументСборШК;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если РежимОткрытия = ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.Загрузка") Тогда
		СменитьСостояниеДокументаОбменаНаСервере(ДокументСсылка, НастройкаДокумента, Состояние);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура КоманадаЗаписать(Команда)
	
	Если РежимОткрытия <> ПредопределенноеЗначение("Перечисление.SUI_РежимыОткрытияДокументаОбмена.Загрузка") Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("КомандаЗаписатьПослеПодтверждения", ЭтотОбъект);
	
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Вы действительно хотите записать данные документа обмена в документ %1?'"), ДокументСсылка);   
	
	ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

//@skip-check bsl-legacy-check-string-literal
#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ИнициализироватьОбъектДокумента()
	
	ОбъектДокумента = ДокументСсылка.ПолучитьОбъект();
	
	ТипРеквизита = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(ОбъектДокумента)));
	ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый РеквизитФормы("Объект", ТипРеквизита)));
	
	//@skip-check wrong-string-literal-content
	ЗначениеВДанныеФормы(ОбъектДокумента, ЭтотОбъект["Объект"]);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРеквизитыИЭлементыФормы(Отказ)
	
	НастройкиДокумента = SUI_НастройкиДокументовСервер.СформироватьНастройкиДокумента(НастройкаДокумента);
	
	Если Не ЗначениеЗаполнено(НастройкиДокумента) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ обмена: %1 (Режим: %2)'"), 
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, "ИмяДокументаМП", ДокументСсылка), РежимОткрытия);
		
	ПорядокКолонок = ПорядокКолонокВТаблицах();
	
	Реквизиты = Новый Массив;
	
	Для Каждого НастройкаТабличнойЧасти Из НастройкиДокумента.ТабличныеЧасти Цикл
		
		Если НастройкаТабличнойЧасти.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
			СтраницаТЧ = Элементы.СтраницаТовары;
		ИначеЕсли НастройкаТабличнойЧасти.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Тогда
			СтраницаТЧ = Элементы.СтраницаОтбор;
		ИначеЕсли НастройкаТабличнойЧасти.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
			СтраницаТЧ = Элементы.СтраницаРазмещение;
		ИначеЕсли НастройкаТабличнойЧасти.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
			СтраницаТЧ = Элементы.СтраницаСерии;
		ИначеЕсли НастройкаТабличнойЧасти.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
			СтраницаТЧ = Элементы.СтраницаШтрихкодыУпаковок;
		Иначе
			Продолжить;
		КонецЕсли;
		
		ИмяТаблицы = SUI_НастройкиДокументовСервер.ИмяТипаТаблицыДокументаОбмена(НастройкаТабличнойЧасти.Ключ);
		ИмяТаблицы = "Таблица" + ИмяТаблицы;
		
		Реквизиты.Очистить();
		НовыйРеквизитТЗ = Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"));
		Реквизиты.Добавить(НовыйРеквизитТЗ);
		
		ПустаяТаблица = SUI_ДокументыОбмена.ТаблицаДокументаПоНастройкеТабличнойЧасти(НастройкаТабличнойЧасти.Значение.Элементы);
		
		Если ПустаяТаблица = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Колонка Из ПустаяТаблица.Колонки Цикл
			Реквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, НовыйРеквизитТЗ.Имя, Колонка.Заголовок));
		КонецЦикла;
		
		ИзменитьРеквизиты(Реквизиты);
		
		ТаблицаФормы = Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), СтраницаТЧ);
		ТаблицаФормы.ПутьКДанным = НовыйРеквизитТЗ.Имя;
	
		ТаблицаФормы.ИзменятьСоставСтрок = Ложь;
		ТаблицаФормы.ИзменятьПорядокСтрок = Ложь;
		ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		
		Для Каждого КолонкаПорядка Из ПорядокКолонок Цикл
			
			КолонкаВТЗ = ПустаяТаблица.Колонки.Найти(КолонкаПорядка);
			
			Если КолонкаВТЗ = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			РеквизитТаблицы = Элементы.Добавить(ТаблицаФормы.Имя + КолонкаВТЗ.Имя, Тип("ПолеФормы"), ТаблицаФормы);
			РеквизитТаблицы.ПутьКДанным = ТаблицаФормы.ПутьКДанным + "." + КолонкаВТЗ.Имя;
			РеквизитТаблицы.Заголовок = КолонкаВТЗ.Заголовок;
			
			Если КолонкаВТЗ.Имя = "qtty" И
				(НастройкаТабличнойЧасти.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
				НастройкаТабличнойЧасти.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
				НастройкаТабличнойЧасти.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) И
				РежимОткрытия = Перечисления.SUI_РежимыОткрытияДокументаОбмена.Загрузка Тогда
				РеквизитТаблицы.Вид = ВидПоляФормы.ПолеВвода;
				РеквизитТаблицы.УстановитьДействие("ПриИзменении", "КоличествоФактПриИзменении");
			ИначеЕсли КолонкаВТЗ.Имя = "ИндексКартинки" Тогда
				РеквизитТаблицы.Вид = ВидПоляФормы.ПолеКартинки;
				РеквизитТаблицы.КартинкаЗначений = БиблиотекаКартинок.SUI_ОкПлюсМинус;
				РеквизитТаблицы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Иначе	
				РеквизитТаблицы.Вид = ВидПоляФормы.ПолеНадписи;
			КонецЕсли;
			
			Если КолонкаВТЗ.Имя = "sid" Тогда
				РеквизитТаблицы.Видимость = Ложь;
			КонецЕсли;
			
		КонецЦикла;

		СтрокаТаблицаНаФорме = ТаблицыНаФорме.Добавить();
		СтрокаТаблицаНаФорме.ТипТаблицы = НастройкаТабличнойЧасти.Ключ;
		СтрокаТаблицаНаФорме.ИмяТаблицы = ИмяТаблицы;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПорядокКолонокВТаблицах()
	
	Порядок = Новый Массив();

	Порядок.Добавить("ИндексКартинки");
	Порядок.Добавить("sid");
	Порядок.Добавить("НомерСтроки");
	Порядок.Добавить("id_good");
	Порядок.Добавить("id_properties");
	Порядок.Добавить("id_property");
	Порядок.Добавить("id_series");
	Порядок.Добавить("id_unit");
	Порядок.Добавить("id_cell");
	Порядок.Добавить("id_price");
	Порядок.Добавить("price");
	Порядок.Добавить("id_marking_code");
	Порядок.Добавить("mark_code");
	Порядок.Добавить("barcode");
	Порядок.Добавить("id_warehouse");
	Порядок.Добавить("РасхождениеПФ");
	Порядок.Добавить("qtty_plan");
	Порядок.Добавить("qtty");

	Возврат Новый ФиксированныйМассив(Порядок);
	
КонецФункции

&НаКлиенте
Процедура ДанныеДокументаОбменаКЗагрузкеВДокумент()
	
	ПараметрыОперации = Новый Структура("ДокументСсылка, НастройкаДокумента", ДокументСсылка, НастройкаДокумента);
	
	ДлительнаяОперация = SUI_ДокументыОбменаВызовСервера.ДанныеДокументаОбменаКЗагрузкеВДокумент(
		ПараметрыОперации, УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ПараметрыОжидания.Заголовок 					= НСтр("ru = 'Получение данных документа обмена'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения 	= Истина;
	ПараметрыОжидания.ВыводитьСообщения 			= Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДанныеДокументаОбменаКЗагрузкеВДокументЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДокументаОбменаКЗагрузкеВДокументЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Закрыть();
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура("АдресРезультата, Закрыть", "", Ложь);
	ПараметрыОповещения.Вставить("Сообщения", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Сообщения", Новый Массив()));
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДанныеДокументаОбменаКЗагрузкеВДокументПродолжитьЗавершение", 
		ЭтотОбъект, ПараметрыОповещения);

	Статус = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Статус", "");
	КраткоеПредставлениеОшибки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "КраткоеПредставлениеОшибки", "");
	ПодробноеПредставлениеОшибки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ПодробноеПредставлениеОшибки", "");

	Если Статус = "Ошибка" Тогда
		ОповещениеОЗавершении.ДополнительныеПараметры.Вставить("Сообщение", ПодробноеПредставлениеОшибки);
		ОповещениеОЗавершении.ДополнительныеПараметры.Закрыть = Истина;
		ПоказатьПредупреждение(ОповещениеОЗавершении, КраткоеПредставлениеОшибки);
	Иначе
		
		ОповещениеОЗавершении.ДополнительныеПараметры.АдресРезультата = Результат.АдресРезультата;
		
		ДанныеДокументаОбменаКЗагрузкеВДокументПродолжитьЗавершение(ОповещениеОЗавершении.ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДокументаОбменаКЗагрузкеВДокументПродолжитьЗавершение(ПараметрыРезультата) Экспорт
	
	Если ПараметрыРезультата.Закрыть Тогда
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;

	Если Не ЗагрузитьДанныеДокументаОбменаВДокументОбъектФормы(ПараметрыРезультата.АдресРезультата) Тогда
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
		ПараметрыРезультата.Вставить("Сообщение", НСтр("ru = 'Не удалось загрузить данные документа объекта на форму.'"));
	КонецЕсли;
	
	ОчиститьСообщения();

	Если ПараметрыРезультата.Свойство("Сообщение") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ПараметрыРезультата.Сообщение);
	КонецЕсли;
	
	Если ПараметрыРезультата.Свойство("Сообщения") Тогда 

		Для Каждого Сообщение Из ПараметрыРезультата.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;  
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗагрузитьДанныеДокументаОбменаВДокументОбъектФормы(АдресРезультата)
	
	Если Не ЗначениеЗаполнено(АдресРезультата) Или
		Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеДокументаОбмена = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	МобильноеУстройство = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаОбмена, "МобильноеУстройство");
	ДатаОбновления = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаОбмена, "ДатаОбновления");
	
	//@skip-check using-form-data-to-value
	ОбъектДокумента = ДанныеФормыВЗначение(ЭтотОбъект["Объект"], ТипЗнч(ДокументСсылка.ПолучитьОбъект()));
	
	SUI_ДокументыОбмена.ЗагрузитьТаблицыДокументаОбменаВДокументОбъект(ОбъектДокумента, 
		ДанныеДокументаОбмена.НастройкаДокумента, ДанныеДокументаОбмена.Таблицы,
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаОбмена, "ТаблицаСерийБезНастройки"));
		
	ЗначениеВДанныеФормы(ОбъектДокумента, ЭтотОбъект["Объект"]);
	
	Для Каждого ТаблицаДокументаОбмена Из ДанныеДокументаОбмена.Таблицы Цикл
		ИмяТаблицы = SUI_НастройкиДокументовСервер.ИмяТипаТаблицыДокументаОбмена(ТаблицаДокументаОбмена.Ключ);
		ЗначениеВДанныеФормы(ТаблицаДокументаОбмена.Значение, ЭтотОбъект["Таблица" + ИмяТаблицы]);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура КомандаЗаписатьПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДокументНаСервере();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("КомандаЗаписатьПослеОтветаЗавершитьДокумент", ЭтотОбъект);
	
	ПоказатьВопрос(ОповещениеОЗавершении, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Данные документа обмена успешно записаны в документ %1.
		|Завершить документ?'"), ДокументСсылка), РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокументНаСервере()

	ТаблицыДокументаОбмена = Новый Соответствие();
	
	Для Каждого ТаблицаНаФорме Из ТаблицыНаФорме Цикл
		ТаблицыДокументаОбмена.Вставить(ТаблицаНаФорме.ТипТаблицы, 
			ЭтотОбъект[ТаблицаНаФорме.ИмяТаблицы].Выгрузить());
	КонецЦикла;
	
	//@skip-check using-form-data-to-value
	SUI_ДокументыОбмена.ЗаписатьДокументОбъект(
		ДанныеФормыВЗначение(ЭтотОбъект["Объект"], ТипЗнч(ДокументСсылка.ПолучитьОбъект())),
		НастройкаДокумента,
		ТаблицыДокументаОбмена,
		ТаблицаСтрокиКОбработкеАлгоритмом.Выгрузить());
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьПослеОтветаЗавершитьДокумент(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Состояние = ПредопределенноеЗначение("Перечисление.SUI_СостоянияДокументовОбмена.Завершен");
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("КомандаЗаписатьПослеОтветаОчисткиПотокаШК", ЭтотОбъект);
	
	Если ЭтоДокументСборШК И ЭтотОбъект["Объект"].Штрихкоды.Количество() > 0 Тогда
		ПоказатьВопрос(ОповещениеОЗавершении, СтрШаблон(НСтр("ru = 'Очистить данные потока штрихкодов документа обмена %1?'"), 
			ДокументСсылка), РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьПослеОтветаОчисткиПотокаШК(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьПотокШтрихкодовНаСервере(ДокументСсылка, НастройкаДокумента);
	КонецЕсли;
	
	Закрыть();
	
	Оповестить("SUI_ПослеЗагрузкиДокументаОбмена");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СменитьСостояниеДокументаОбменаНаСервере(ДокументСсылка, НастройкаДокумента, НовоеСостояние, ОбновитьМеткуВремени = Истина)
	SUI_ДокументыОбмена.СменитьСостояниеДокументаОбмена(НовоеСостояние, ДокументСсылка, НастройкаДокумента, Истина, ОбновитьМеткуВремени);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоФактПриИзменении(Элемент)

	Если Не СтрНачинаетсяС(Элемент.Имя, "Таблица") Или
		Прав(Элемент.Имя, 4) <> "qtty" Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = СтрЗаменить(Элемент.Имя, "qtty", "");
	
	Если Элементы.Найти(ИмяТаблицы) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или
		Не ТекущиеДанные.Свойство("НомерСтроки") Или 
		Не ТекущиеДанные.Свойство("qtty") Или
		Не ТекущиеДанные.Свойство("sid") Тогда
		Возврат;
	КонецЕсли;

	КоличествоФактПриИзмененииНаСервере(ИмяТаблицы, ТекущиеДанные.sid, ТекущиеДанные.НомерСтроки, ТекущиеДанные.qtty);

КонецПроцедуры

//@skip-check bsl-variable-name-invalid
&НаСервере
Процедура КоличествоФактПриИзмененииНаСервере(ИмяТаблицы, sid, НомерСтроки, НовоеКоличество)

	Если Не ЗначениеЗаполнено(ИмяТаблицы) Или 
		Не ЗначениеЗаполнено(НомерСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыНаФормеПоОтбору = ТаблицыНаФорме.НайтиСтроки(Новый Структура("ИмяТаблицы", ИмяТаблицы));
	
	Если ТаблицыНаФормеПоОтбору.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипТаблицы = ТаблицыНаФормеПоОтбору[0].ТипТаблицы;
	
	Если ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары И
		ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор И
		ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиДокумента = SUI_НастройкиДокументовСервер.СформироватьНастройкиДокумента(НастройкаДокумента);

	НастройкиТЧ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, 
		"ТабличныеЧасти", Новый Соответствие(), Тип("Соответствие"));
	
	НастройкаТЧ = НастройкиТЧ.Получить(ТипТаблицы);
	
	Если Не ЗначениеЗаполнено(НастройкаТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = ЭтотОбъект["Объект"][НастройкаТЧ.ИмяТабличнойЧасти].НайтиСтроки(Новый Структура("НомерСтроки", НомерСтроки));
	
	Если ТекущаяСтрока.Количество() = 0 Тогда
		Возврат;
	Иначе
		ТекущаяСтрока = ТекущаяСтрока[0];
	КонецЕсли;
	
	НастройкаРеквизитаКоличество = НастройкаТЧ.Элементы.Получить("qtty");
	
	Если Не ЗначениеЗаполнено(НастройкаРеквизитаКоличество) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока[НастройкаРеквизитаКоличество.Имя] = НовоеКоличество;
	
	СтрокаКОбработкеАлгоритмом = ТаблицаСтрокиКОбработкеАлгоритмом.Добавить();
	
	СтрокаКОбработкеАлгоритмом.ТипТаблицы = ТипТаблицы;
	СтрокаКОбработкеАлгоритмом.НомерСтроки = ТекущаяСтрока.НомерСтроки;
	
	// Обновить индекс картинки строки
	СтрокиТаблицыДокументаОбмена = ЭтотОбъект[ИмяТаблицы].НайтиСтроки(Новый Структура("sid", sid));
	Для Каждого СтрокаТаблицыДокументаОбмена Из СтрокиТаблицыДокументаОбмена Цикл
		
		Если Не СтрокаТаблицыДокументаОбмена.Свойство("ИндексКартинки") Или
			Не СтрокаТаблицыДокументаОбмена.Свойство("qtty") Или
			Не СтрокаТаблицыДокументаОбмена.Свойство("qtty_plan") Тогда
			Прервать;
		КонецЕсли;
		
		Если СтрокаТаблицыДокументаОбмена["qtty"] > 0 И СтрокаТаблицыДокументаОбмена["qtty"] = СтрокаТаблицыДокументаОбмена["qtty_plan"] Тогда
			СтрокаТаблицыДокументаОбмена["ИндексКартинки"] = 0;
		ИначеЕсли СтрокаТаблицыДокументаОбмена["qtty"] > СтрокаТаблицыДокументаОбмена["qtty_plan"] Тогда
			СтрокаТаблицыДокументаОбмена["ИндексКартинки"] = 1;
		ИначеЕсли СтрокаТаблицыДокументаОбмена["qtty"] < СтрокаТаблицыДокументаОбмена["qtty_plan"] Тогда
			СтрокаТаблицыДокументаОбмена["ИндексКартинки"] = 2;
		Иначе
			СтрокаТаблицыДокументаОбмена["ИндексКартинки"] = 3;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьПотокШтрихкодовНаСервере(ДокументСсылка, НастройкаДокумента)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПотокШтрихкодов.Период,
		|	ПотокШтрихкодов.sid,
		|	ПотокШтрихкодов.sid_doc
		|ИЗ
		|	РегистрСведений.SUI_docs КАК ДокументыОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcode_flow КАК ПотокШтрихкодов
		|		ПО ДокументыОбмена.sid = ПотокШтрихкодов.sid_doc
		|ГДЕ
		|	ДокументыОбмена.id_doc = &ИдентификаторДокумента
		|	И ДокументыОбмена.НастройкаДокумента = &НастройкаДокумента";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументСсылка));
	Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_barcode_flow");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
				ЭлементБлокировки.УстановитьЗначение("Период", Выборка.Период);
				ЭлементБлокировки.УстановитьЗначение("sid", Выборка.sid);
				ЭлементБлокировки.УстановитьЗначение("sid_doc", Выборка.sid_doc);
				Блокировка.Заблокировать();
			
				НаборЗаписей = РегистрыСведений.SUI_docs_tbl_barcode_flow.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
				НаборЗаписей.Отбор.sid_doc.Установить(Выборка.sid_doc);
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("SUI_ОтключитьПодписку");
				НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
				
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
